package com.fanleagueent.fanleague.presentation.constants;

/**
 * Created by alexeyverbitskiy on 12/1/16.
 */

public interface Patterns {
    String USER_DATA_PATTERN = "^([\\w-\\D]*[^~|/\"`\\<>?×℅\\[\\!”№%\\:,\\.;\\)_\\+\\=®†÷°©ћыћ©\u20BD™љ\\~ѕў≥≤“ј÷ƒ©µ\\!@£\\$%\\^&\\*\\(\\)\\+_\\=€#¢∞§¶•ªº≠œ∑®†¥øπ“‘«åß∂ƒ©˙∆˚¬…æΩ≈ç√∫\\~µ≤≥÷\\!@#\\$%\\^&\\*\\{\\}”№%\\:,\\.;\\(\\)_\\+\\=»≠€\\]])$";
    String USERNAME_PATTERN = "[a-zA-Z0-9-_+]*";
    String TEAM_PATTERN = "^([\\w-\\D]*[^~|/\"`\\<>?×℅\\[\\!”№%\\:,\\.;\\)_\\+\\=®†÷°©ћыћ©\u20BD™љ\\~ѕў≥≤“ј÷ƒ©µ\\!@£\\$%\\^&\\*\\(\\)\\+_\\=€#¢∞§¶•ªº≠œ∑®†¥øπ“‘«åß∂ƒ©˙∆˚¬…æΩ≈ç√∫\\~µ≤≥÷\\!@#\\$%\\^&\\*\\{\\}”№%\\:,\\.;\\(\\)_\\+\\=»≠€\\]])$";
    String LEAGUE_PATTERN = "^([\\w-\\D]*[^~|/\"`\\<>?×℅\\[\\!”№%\\:,\\.;\\)_\\+\\=®†÷°©ћыћ©\u20BD™љ\\~ѕў≥≤“ј÷ƒ©µ\\!@£\\$%\\^&\\*\\(\\)\\+_\\=€#¢∞§¶•ªº≠œ∑®†¥øπ“‘«åß∂ƒ©˙∆˚¬…æΩ≈ç√∫\\~µ≤≥÷\\!@#\\$%\\^&\\*\\{\\}”№%\\:,\\.;\\(\\)_\\+\\=»≠€\\]])$";

    String PASSWORD_PATTERN = "^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z])(?!.*\\s).{4,}$";
}
